Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/tcmecc.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief TCMECC register API structure */
typedef struct
{
  __IO  uint32_t                       TCMECC_CR;          /**< Offset: 0x00 (R/W  32) TCMECC Control Register */
  __IO  uint32_t                       TCMECC_TESTCB1;     /**< Offset: 0x04 (R/W  32) TCMECC Test mode register 1 */
  __I   uint8_t                        Reserved1[0x04];
  __I   uint32_t                       TCMECC_SR;          /**< Offset: 0x0C (R/   32) TCMECC Status register */
  __O   uint32_t                       TCMECC_IER;         /**< Offset: 0x10 ( /W  32) TCMECC Interrupt Enable Register */
  __O   uint32_t                       TCMECC_IDR;         /**< Offset: 0x14 ( /W  32) TCMECC Interrupt Disable Register */
  __I   uint32_t                       TCMECC_IMR;         /**< Offset: 0x18 (R/   32) TCMECC Interrupt Mask Register */
  __I   uint32_t                       TCMECC_FAILAR;      /**< Offset: 0x1C (R/   32) TCMECC Fail address register */
  __I   uint32_t                       TCMECC_FAILARD;     /**< Offset: 0x20 (R/   32) TCMECC Fail address register data */
  __I   uint32_t                       TCMECC_FAILDR;      /**< Offset: 0x24 (R/   32) TCMECC Fail data register */
  __I   uint32_t                       TCMECC_FAILDRD;     /**< Offset: 0x28 (R/   32) TCMECC Fail data register data */
} tcmecc_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH707_TCMECC_COMPONENT_H_ */
